[
  {
    "id": "phr_001",
    "text": "Which of the following best describes the purpose of the Universal Declaration of Human Rights (UDHR)?",
    "options": [
      { "id": "a", "text": "To impose identical laws on all member states of the United Nations" },
      { "id": "b", "text": "To outline fundamental human rights that should be universally protected" },
      { "id": "c", "text": "To replace national constitutions with a global bill of rights" },
      { "id": "d", "text": "To allow countries to withdraw from human rights obligations" }
    ],
    "correctAnswer": "b",
    "explanation": "The UDHR serves as a universal standard for fundamental human rights that all nations should uphold.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_002",
    "text": "Which government body in the Philippines is primarily responsible for the promotion and protection of human rights?",
    "options": [
      { "id": "a", "text": "Department of Justice (DOJ)" },
      { "id": "b", "text": "Supreme Court (SC)" },
      { "id": "c", "text": "Commission on Human Rights (CHR)" },
      { "id": "d", "text": "Civil Service Commission (CSC)" }
    ],
    "correctAnswer": "c",
    "explanation": "The Commission on Human Rights (CHR) is mandated to investigate human rights violations and promote human rights awareness.",
    "category": "Peace and Human Rights",
    "difficulty": "easy",
    "language": "english"
  },
  {
    "id": "phr_003",
    "text": "A peace-building approach that addresses the root causes of conflict by promoting social justice, equality, and economic opportunity is known as:",
    "options": [
      { "id": "a", "text": "Conflict escalation" },
      { "id": "b", "text": "Structural peacebuilding" },
      { "id": "c", "text": "Ceasefire negotiation" },
      { "id": "d", "text": "Peacekeeping operations" }
    ],
    "correctAnswer": "b",
    "explanation": "Structural peacebuilding focuses on resolving underlying social, political, and economic issues that fuel conflict.",
    "category": "Peace and Human Rights",
    "difficulty": "difficult",
    "language": "english"
  },
  {
    "id": "phr_004",
    "text": "Which of the following actions BEST reflects respect for cultural rights?",
    "options": [
      { "id": "a", "text": "Discouraging indigenous traditions to promote modernization" },
      { "id": "b", "text": "Allowing communities to freely practice their languages and customs" },
      { "id": "c", "text": "Mandating one national culture for unity" },
      { "id": "d", "text": "Restricting cultural festivals to avoid public gatherings" }
    ],
    "correctAnswer": "b",
    "explanation": "Cultural rights include the freedom of individuals and communities to practice and preserve their cultural traditions.",
    "category": "Peace and Human Rights",
    "difficulty": "easy",
    "language": "english"
  },
  {
    "id": "phr_005",
    "text": "Which principle states that no person shall be subjected to torture or to cruel, inhuman, or degrading treatment or punishment?",
    "options": [
      { "id": "a", "text": "Right to Due Process" },
      { "id": "b", "text": "Right to Self-Determination" },
      { "id": "c", "text": "Prohibition Against Torture" },
      { "id": "d", "text": "Right to Privacy" }
    ],
    "correctAnswer": "c",
    "explanation": "The prohibition against torture is a non-derogable human right under both international and Philippine laws.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_006",
    "text": "Ang Batas Republika 9262 (Anti-Violence Against Women and Their Children Act of 2004) ay pangunahing nagpoprotekta laban sa anong uri ng karahasan?",
    "options": [
      { "id": "a", "text": "Karahasan sa lugar ng trabaho (workplace violence)" },
      { "id": "b", "text": "Karahasan sa loob ng pamilya (domestic violence)" },
      { "id": "c", "text": "Karahasan na may kaugnayan sa eleksyon (election-related violence)" },
      { "id": "d", "text": "Karahasan na dulot ng terorismo (terrorism-related violence)" }
    ],
    "correctAnswer": "b",
    "explanation": "Ang RA 9262, o mas kilala bilang Anti-VAWC, ay naglalayong protektahan ang kababaihan at ang kanilang mga anak laban sa karahasang pisikal, emosyonal, seksuwal, at ekonomiko sa konteksto ng relasyon sa pamilya o dating kasama.",
    "category": "Peace and Human Rights",
    "difficulty": "easy",
    "language": "filipino"
  },
  {
    "id": "phr_007",
    "text": "What is the constitutional basis in the Philippines for the protection of indigenous cultural communities and their ancestral domains?",
    "options": [
      { "id": "a", "text": "Article II (Declaration of Principles and State Policies)" },
      { "id": "b", "text": "Article III (Bill of Rights)" },
      { "id": "c", "text": "Article XII (National Economy and Patrimony)" },
      { "id": "d", "text": "Article XIV (Education, Science and Technology, Arts, Culture, and Sports)" }
    ],
    "correctAnswer": "d",
    "explanation": "Article XIV, Section 17, of the 1987 Philippine Constitution specifically mandates the State to recognize, respect, and protect the rights of indigenous cultural communities to preserve and develop their cultures, traditions, and institutions.",
    "category": "Peace and Human Rights",
    "difficulty": "difficult",
    "language": "english"
  },
  {
    "id": "phr_008",
    "text": "The mandate of the Commission on Human Rights (CHR) includes all of the following, EXCEPT:",
    "options": [
      { "id": "a", "text": "Investigate all forms of human rights violations involving civil and political rights" },
      { "id": "b", "text": "Provide legal aid services to victims of human rights violations" },
      { "id": "c", "text": "Declare martial law during times of rebellion or invasion" },
      { "id": "d", "text": "Recommend measures to Congress to promote human rights" }
    ],
    "correctAnswer": "c",
    "explanation": "The power to declare martial law belongs solely to the President, subject to Congressional review and Supreme Court oversight, not the CHR. The CHR's role is investigative and recommendatory.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_009",
    "text": "The Comprehensive Agreement on the Bangsamoro (CAB) is an agreement signed between the Philippine Government and which organization?",
    "options": [
      { "id": "a", "text": "New People's Army (NPA)" },
      { "id": "b", "text": "Moro Islamic Liberation Front (MILF)" },
      { "id": "c", "text": "Moro National Liberation Front (MNLF)" },
      { "id": "d", "text": "Abu Sayyaf Group (ASG)" }
    ],
    "correctAnswer": "b",
    "explanation": "The CAB, signed in 2014, is the peace agreement between the Philippine Government and the Moro Islamic Liberation Front (MILF), leading to the establishment of the Bangsamoro Autonomous Region in Muslim Mindanao (BARMM).",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_010",
    "text": "Under the Bill of Rights (Article III) of the 1987 Philippine Constitution, the right of the people to be secure in their persons, houses, papers, and effects against unreasonable searches and seizures is guaranteed by the issuance of a:",
    "options": [
      { "id": "a", "text": "Writ of Amparo" },
      { "id": "b", "text": "Writ of Habeas Corpus" },
      { "id": "c", "text": "Search Warrant or Warrant of Arrest" },
      { "id": "d", "text": "Writ of Kalikasan" }
    ],
    "correctAnswer": "c",
    "explanation": "A Search Warrant or Warrant of Arrest, issued by a judge upon probable cause, is required for a lawful search or seizure, protecting citizens from unreasonable intrusions by the state.",
    "category": "Peace and Human Rights",
    "difficulty": "easy",
    "language": "english"
  },
  {
    "id": "phr_011",
    "text": "Alin sa mga sumusunod ang isang karapatang sibil (civil right) na nakapaloob sa Bill of Rights?",
    "options": [
      { "id": "a", "text": "Karapatang bumoto (Right to suffrage)" },
      { "id": "b", "text": "Karapatang magkaroon ng trabaho (Right to employment)" },
      { "id": "c", "text": "Karapatang maging malaya sa relihiyon (Freedom of religion)" },
      { "id": "d", "text": "Karapatan sa edukasyon (Right to education)" }
    ],
    "correctAnswer": "c",
    "explanation": "Ang Freedom of Religion, kasama ng freedom of speech at right to due process, ay inuuri bilang civil at political rights na nasa Article III (Bill of Rights). Ang iba ay economic, social, at cultural rights.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "filipino"
  },
  {
    "id": "phr_012",
    "text": "The concept of 'substantive equality' in human rights, particularly regarding women, primarily means:",
    "options": [
      { "id": "a", "text": "Treating men and women exactly the same under the law (formal equality)" },
      { "id": "b", "text": "Recognizing that different treatments may be necessary to achieve equal outcomes" },
      { "id": "c", "text": "Granting all rights only to women" },
      { "id": "d", "text": "Equality applies only in the political sphere" }
    ],
    "correctAnswer": "b",
    "explanation": "Substantive equality recognizes that because of historical discrimination, unequal treatment may sometimes be required (e.g., affirmative action or special protections) to ensure that women can enjoy the same rights and opportunities as men in reality.",
    "category": "Peace and Human Rights",
    "difficulty": "difficult",
    "language": "english"
  },
  {
    "id": "phr_013",
    "text": "What is the primary goal of the Philippine GAD (Gender and Development) Budget Policy?",
    "options": [
      { "id": "a", "text": "To allocate all government funds to programs exclusively for women" },
      { "id": "b", "text": "To ensure that all government programs and projects address gender issues and promote gender equality" },
      { "id": "c", "text": "To fund military operations involving female soldiers" },
      { "id": "d", "text": "To mandate equal salaries for all public servants" }
    ],
    "correctAnswer": "b",
    "explanation": "The GAD Budget Policy requires all government agencies to allocate a portion (at least 5%) of their budgets to implement gender-responsive programs and projects.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_014",
    "text": "Ang batas na nagbibigay-proteksyon sa mga bata laban sa pang-aabuso, pagsasamantala, at diskriminasyon sa Pilipinas ay ang:",
    "options": [
      { "id": "a", "text": "Republic Act 7160 (Local Government Code)" },
      { "id": "b", "text": "Republic Act 7610 (Special Protection of Children Against Abuse, Exploitation and Discrimination Act)" },
      { "id": "c", "text": "Republic Act 9165 (Comprehensive Dangerous Drugs Act)" },
      { "id": "d", "text": "Republic Act 9262 (Anti-VAWC Act)" }
    ],
    "correctAnswer": "b",
    "explanation": "Ang RA 7610 ang pangunahing batas na nagbibigay-proteksyon sa mga bata sa Pilipinas mula sa lahat ng uri ng pang-aabuso at pagsasamantala.",
    "category": "Peace and Human Rights",
    "difficulty": "easy",
    "language": "filipino"
  },
  {
    "id": "phr_015",
    "text": "What does the Philippine concept of 'Karapatan sa Kapayapaan' (Right to Peace) fundamentally advocate for?",
    "options": [
      { "id": "a", "text": "The right of the military to maintain public order" },
      { "id": "b", "text": "The right to live in a secure, non-violent environment where all human rights are respected" },
      { "id": "c", "text": "The right to travel freely abroad" },
      { "id": "d", "text": "The right to bear arms for self-defense" }
    ],
    "correctAnswer": "b",
    "explanation": "The Right to Peace is a collective human right that goes beyond the absence of conflict; it includes the realization of full human security, sustainable development, and respect for all human rights.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_016",
    "text": "The principle of non-derogability in human rights law primarily applies to which group of rights?",
    "options": [
      { "id": "a", "text": "Economic, Social, and Cultural Rights (e.g., right to education)" },
      { "id": "b", "text": "Civil and Political Rights (e.g., right to assembly)" },
      { "id": "c", "text": "Rights that cannot be suspended even during times of public emergency" },
      { "id": "d", "text": "Rights that apply only in peacetime" }
    ],
    "correctAnswer": "c",
    "explanation": "Non-derogable rights are fundamental rights (like the prohibition against torture, slavery, and the right to life) that must be respected at all times and cannot be suspended or limited by the state, even in extreme situations like war or national emergency.",
    "category": "Peace and Human Rights",
    "difficulty": "difficult",
    "language": "english"
  },
  {
    "id": "phr_017",
    "text": "Which term describes the process where former enemies are assisted in negotiating a solution to their conflict without external imposition?",
    "options": [
      { "id": "a", "text": "Adjudication" },
      { "id": "b", "text": "Mediation" },
      { "id": "c", "d": "Facilitation" },
      { "id": "d", "text": "Arbitration" }
    ],
    "correctAnswer": "b",
    "explanation": "Mediation involves a neutral third party assisting the parties to reach their own agreement. Arbitration involves a third party making a binding decision, and Adjudication involves a judicial decision.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_018",
    "text": "Which legal remedy is used in the Philippines to challenge the legality of the detention of a person and compel the detaining authority to produce the body in court?",
    "options": [
      { "id": "a", "text": "Writ of Amparo" },
      { "id": "b", "text": "Writ of Habeas Corpus" },
      { "id": "c", "text": "Writ of Kalikasan" },
      { "id": "d", "text": "Writ of Certiorari" }
    ],
    "correctAnswer": "b",
    "explanation": "The Writ of Habeas Corpus is a procedural remedy to test the legality of a person's detention, ensuring that no one is imprisoned without legal justification.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_019",
    "text": "The term 'Negative Peace' is best characterized by:",
    "options": [
      { "id": "a", "text": "The total absence of violence and conflict." },
      { "id": "b", "text": "The presence of social justice and equality." },
      { "id": "c", "text": "The absence of direct, organized violence (e.g., a ceasefire)." },
      { "id": "d", "text": "The existence of strong political institutions." }
    ],
    "correctAnswer": "c",
    "explanation": "Negative Peace refers to the absence of direct violence or war. Positive Peace refers to the presence of social justice, equality, and structures that prevent violence (absence of structural violence).",
    "category": "Peace and Human Rights",
    "difficulty": "difficult",
    "language": "english"
  },
  {
    "id": "phr_020",
    "text": "Which international convention prohibits all forms of discrimination against women?",
    "options": [
      { "id": "a", "text": "The Geneva Conventions" },
      { "id": "b", "text": "International Covenant on Civil and Political Rights (ICCPR)" },
      { "id": "c", "text": "Convention on the Rights of the Child (CRC)" },
      { "id": "d", "text": "Convention on the Elimination of All Forms of Discrimination Against Women (CEDAW)" }
    ],
    "correctAnswer": "d",
    "explanation": "CEDAW is the primary international treaty dedicated entirely to women's rights, establishing a comprehensive standard for equality and protection.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_021",
    "text": "Which of the following Philippine laws is crucial for protecting the rights of Indigenous Peoples by recognizing their rights to their ancestral domains and self-governance?",
    "options": [
      { "id": "a", "text": "The Comprehensive Agrarian Reform Law (CARL)" },
      { "id": "b", "text": "The Indigenous Peoples' Rights Act (IPRA or RA 8371)" },
      { "id": "c", "text": "The Local Government Code (LGC)" },
      { "id": "d", "text": "The Clean Air Act" }
    ],
    "correctAnswer": "b",
    "explanation": "The IPRA (RA 8371) is the landmark law that implements the constitutional mandate to recognize and protect the rights of Indigenous Cultural Communities/Indigenous Peoples (ICCs/IPs).",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_022",
    "text": "The concept of 'transitional justice' in post-conflict settings primarily focuses on:",
    "options": [
      { "id": "a", "text": "Establishing a permanent military presence to deter future conflicts." },
      { "id": "b", "text": "Providing mechanisms for accountability, redress, and truth-seeking for past abuses." },
      { "id": "c", "d": "Implementing immediate economic reforms to create jobs." },
      { "id": "d", "text": "Fully integrating the former rebel group into the military." }
    ],
    "correctAnswer": "b",
    "explanation": "Transitional justice is the set of judicial and non-judicial measures (like truth commissions, reparations, prosecutions, and institutional reform) implemented to address the legacies of mass human rights abuses.",
    "category": "Peace and Human Rights",
    "difficulty": "difficult",
    "language": "english"
  },
  {
    "id": "phr_023",
    "text": "The Writ of Amparo is a special legal remedy available in the Philippines to protect which specific rights?",
    "options": [
      { "id": "a", "text": "The right to a clean and healthy environment." },
      { "id": "b", "text": "The right to speedy trial and fair compensation." },
      { "id": "c", "text": "The right to life, liberty, and security of persons." },
      { "id": "d", "text": "The right to form associations and unions." }
    ],
    "correctAnswer": "c",
    "explanation": "The Writ of Amparo (Spanish for 'protection') is a remedy for extra-judicial killings and enforced disappearances, designed to protect the constitutional rights to life, liberty, and security of the person.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_024",
    "text": "In the context of the peace process in Mindanao, what is the significance of the Bangsamoro Organic Law (BOL)?",
    "options": [
      { "id": "a", "text": "It declared a permanent cessation of hostilities in the region." },
      { "id": "b", "text": "It established the Bangsamoro Autonomous Region in Muslim Mindanao (BARMM), replacing the ARMM." },
      { "id": "c", "text": "It is the constitution of the new independent Bangsamoro state." },
      { "id": "d", "text": "It is the peace agreement signed with the MNLF." }
    ],
    "correctAnswer": "b",
    "explanation": "The BOL (RA 11054) is the law that codified the Comprehensive Agreement on the Bangsamoro (CAB) into law, establishing the BARMM with greater fiscal and political autonomy.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_025",
    "text": "The Optional Protocol to the Convention Against Torture (OPCAT), ratified by the Philippines, requires the establishment of a National Preventive Mechanism (NPM). What is the NPM's function?",
    "options": [
      { "id": "a", "text": "To prosecute state agents who commit torture." },
      { "id": "b", "text": "To conduct regular, unannounced visits to detention facilities to prevent torture." },
      { "id": "c", "text": "To provide financial compensation to torture victims." },
      { "id": "d", "text": "To draft new anti-torture legislation." }
    ],
    "correctAnswer": "b",
    "explanation": "The NPM's key function under the OPCAT is proactive prevention—conducting regular visits to all places of detention (jails, police stations, hospitals, etc.) to assess and improve conditions and prevent torture.",
    "category": "Peace and Human Rights",
    "difficulty": "difficult",
    "language": "english"
  },
  {
    "id": "phr_026",
    "text": "Which right under the Philippine Bill of Rights is specifically designed to protect an accused person from forced, self-incrimination?",
    "options": [
      { "id": "a", "text": "Right against ex post facto law" },
      { "id": "b", "text": "Right to counsel" },
      { "id": "c", "text": "Right to silence" },
      { "id": "d", "text": "Right against double jeopardy" }
    ],
    "correctAnswer": "c",
    "explanation": "The right to silence and the related right against compulsory self-incrimination ensures that a person cannot be forced to testify against themselves in any criminal proceeding.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_027",
    "text": "In the context of international human rights law, what are the three distinct yet interdependent generations of human rights?",
    "options": [
      { "id": "a", "text": "National, Regional, and Global rights" },
      { "id": "b", "text": "Civil-Political, Economic-Social-Cultural, and Solidarity rights" },
      { "id": "c", "text": "Individual, Community, and State rights" },
      { "id": "d", "text": "Formal, Substantive, and Remedial rights" }
    ],
    "correctAnswer": "b",
    "explanation": "The three generations are: First Generation (Civil and Political), Second Generation (Economic, Social, and Cultural), and Third Generation (Solidarity or Collective rights, like the right to a healthy environment).",
    "category": "Peace and Human Rights",
    "difficulty": "difficult",
    "language": "english"
  },
  {
    "id": "phr_028",
    "text": "What is the primary objective of a Truth Commission in a post-conflict or post-authoritarian society?",
    "options": [
      { "id": "a", "text": "To sentence and imprison perpetrators of human rights abuses." },
      { "id": "b", "text": "To create an accurate and comprehensive record of past human rights violations." },
      { "id": "c", "text": "To provide a complete amnesty for all political crimes." },
      { "id": "d", "text": "To manage the immediate disarmament of all combatants." }
    ],
    "correctAnswer": "b",
    "explanation": "Truth Commissions are non-judicial bodies established to investigate and report on past human rights abuses, focusing on truth-telling and victim recognition rather than prosecution.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_029",
    "text": "The principle of 'progressive realization' is most relevant to the implementation of which category of rights?",
    "options": [
      { "id": "a", "text": "Civil Rights" },
      { "id": "b", "text": "Political Rights" },
      { "id": "c", "text": "Economic, Social, and Cultural (ESC) Rights" },
      { "id": "d", "text": "Non-derogable Rights" }
    ],
    "correctAnswer": "c",
    "explanation": "Progressive realization recognizes that ESC rights (like the right to health, education, and housing) require resources and time, and must be implemented incrementally, to the maximum of available resources.",
    "category": "Peace and Human Rights",
    "difficulty": "difficult",
    "language": "english"
  },
  {
    "id": "phr_030",
    "text": "Which of the following is considered a violation of the right to due process?",
    "options": [
      { "id": "a", "text": "A suspect is immediately arrested after a warrant is issued." },
      { "id": "b", "text": "A person is convicted based on evidence obtained through unlawful search." },
      { "id": "c", "text": "A government employee is suspended pending investigation." },
      { "id": "d", "text": "A case takes three years to resolve in the Supreme Court." }
    ],
    "correctAnswer": "b",
    "explanation": "The principle of 'fruit of the poisonous tree' dictates that evidence obtained illegally (unlawful search) is inadmissible in court, which is a key component of due process (the exclusionary rule).",
    "category": "Peace and Human Rights",
    "difficulty": "hard",
    "language": "english"
  },
  {
    "id": "phr_031",
    "text": "The primary objective of the GPH-NDF Peace Process is to achieve a negotiated settlement between the Philippine Government and which group?",
    "options": [
      { "id": "a", "text": "Moro Islamic Liberation Front (MILF)" },
      { "id": "b", "text": "Moro National Liberation Front (MNLF)" },
      { "id": "c", "d": "Communist Party of the Philippines - New People's Army - National Democratic Front (CPP-NPA-NDF)" },
      { "id": "d", "text": "Abu Sayyaf Group (ASG)" }
    ],
    "correctAnswer": "c",
    "explanation": "The GPH-NDF (Government of the Philippines - National Democratic Front) peace process deals with the long-running insurgency by the communist movement.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_032",
    "text": "The Universal Declaration of Human Rights (UDHR) was proclaimed in which year?",
    "options": [
      { "id": "a", "text": "1945 (End of WWII)" },
      { "id": "b", "text": "1948 (Post-WWII establishment of UN Commission on Human Rights)" },
      { "id": "c", "text": "1951 (Start of Korean War)" },
      { "id": "d", "text": "1966 (Adoption of ICCPR and ICESCR)" }
    ],
    "correctAnswer": "b",
    "explanation": "The UDHR was adopted and proclaimed by the United Nations General Assembly on December 10, 1948, marking a key moment in the international human rights movement.",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_033",
    "text": "What does the Philippine concept of 'Karapatang Pantao' (Human Rights) fundamentally imply about the role of the State?",
    "options": [
      { "id": "a", "text": "That the State is the source of all rights." },
      { "id": "b", "text": "That the State has the duty to respect, protect, and fulfill these inherent rights." },
      { "id": "c", "text": "That the State can suspend all rights during emergencies." },
      { "id": "d", "text": "That the State only needs to enforce civil and political rights." }
    ],
    "correctAnswer": "b",
    "explanation": "The tripartite duties of the State regarding human rights are to Respect (refrain from violating), Protect (prevent violations by third parties), and Fulfill (take positive measures to realize) the rights.",
    "category": "Peace and Human Rights",
    "difficulty": "difficult",
    "language": "english"
  },
  {
    "id": "phr_034",
    "text": "In the Philippines, the law mandating the observance of the rights of all persons with disabilities and providing for their rehabilitation, self-development, and self-reliance is known as:",
    "options": [
      { "id": "a", "text": "RA 8435 (Agriculture and Fisheries Modernization Act)" },
      { "id": "b", "text": "RA 7277 (Magna Carta for Disabled Persons, as amended)" },
      { "id": "c", "text": "RA 9710 (Magna Carta of Women)" },
      { "id": "d", "text": "RA 10066 (National Cultural Heritage Act)" }
    ],
    "correctAnswer": "b",
    "explanation": "RA 7277, the Magna Carta for Disabled Persons (as amended by RA 9442 and RA 10754), is the specific legislation that grants rights and privileges to Persons with Disabilities (PWDs).",
    "category": "Peace and Human Rights",
    "difficulty": "moderate",
    "language": "english"
  },
  {
    "id": "phr_035",
    "text": "The principle of Indivisibility and Interdependence in human rights means that:",
    "options": [
      { "id": "a", "text": "Civil rights must be prioritized over economic rights." },
      { "id": "b", "text": "The fulfillment of one right often depends on the fulfillment of others." },
      { "id": "c", "text": "Human rights are only applicable to certain countries." },
      { "id": "d", "text": "Rights can be traded off against each other in times of crisis." }
    ],
    "correctAnswer": "b",
    "explanation": "Indivisibility means all rights are equally important, and Interdependence means they are interconnected. For example, the right to education (ESC) is essential for exercising the right to vote (Civil/Political).",
    "category": "Peace and Human Rights",
    "difficulty": "difficult",
    "language": "english"
  }
]
